alenly445/esp32-camera-line-following/esp32_car_vision/sdkconfig.defaults
# ESP32-S3 car vision profile: 16MB Flash + Octal PSRAM.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=2048
# Larger TCP windows keep the MJPEG stream responsive over Wi-Fi.
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=23392
CONFIG_LWIP_TCP_WND_DEFAULT=23392
